Config.org
#+DESCRIPTION: A literate configuration for a modern, Vim-powered workspace.
#+OPTIONS: toc:2
#+PROPERTY: header-args:emacs-lisp :tangle yes

* Table of Contents :toc:
- [[#system-initialization][System Initialization]]
- [[#visual-aesthetics][Visual Aesthetics]]
- [[#the-vim-engine-evil-mode][The Vim Engine (Evil Mode)]]
- [[#workspace--navigation][Workspace & Navigation]]
- [[#developer-tools][Developer Tools]]
- [[#the-org-universe][The Org Universe]]
- [[#development][Development]]

* System Initialization
Before we can build the editor, we need to bootstrap the package management system. This ensures that whenever this configuration is loaded on a new machine, Emacs knows exactly where to download our tools.

** Package Manager Setup
We use =use-package= to safely declare and install all external packages. It keeps our configuration incredibly clean and prevents Emacs from crashing if a package fails to download.

#+begin_src emacs-lisp
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src

** Icons 
#+begin_src emacs-lisp
  (use-package all-the-icons
  :if (display-graphic-p)
  :config
  (unless (find-font (font-spec :name "all-the-icons"))
    (all-the-icons-install-fonts t)))

  (use-package nerd-icons
  :if (display-graphic-p)
  :config
  (unless (find-font (font-spec :name "Symbols Nerd Font Mono"))
    (nerd-icons-install-fonts t)))
#+end_src

* Visual Aesthetics
By default, Emacs looks like a piece of software from the 1980s. This section strips away the outdated UI elements (toolbars, scrollbars) and applies a modern, readable aesthetic.

** Core UI Cleanup
Disable the visual noise to maximize screen real estate for actual code and text.

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
  (scroll-bar-mode -1)             ;; Disable visible scrollbar
  (tool-bar-mode -1)               ;; Disable the toolbar
  (tooltip-mode -1)                ;; Disable tooltip mode
  (windmove-default-keybindings)   ;; Navigate between split windows using Shift + Arrow keys
  (setq visible-bell t)            ;; Visual flash instead of audio beep

  (set-face-attribute 'default nil :height 140) ;; Set default font size
  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative)
#+end_src

** Theme & Modeline
We are currently using the Solarized Light theme, paired with the Doom Modeline for a beautiful, informative status bar at the bottom of the screen.

#+begin_src emacs-lisp
  (use-package doom-themes)
  (load-theme 'doom-solarized-light t)

  (use-package all-the-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))

  ;; Disable line numbers for specific non-coding buffers
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  eshell-mode-hook
                  vterm-mode-hook
                  treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode -1))))
#+end_src

* The Vim Engine (Evil Mode)
Emacs is the best operating system, but Vim is the best text-editing language. This section wires up =evil-mode= to give us full modal editing capabilities.

#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)
    (evil-set-initial-state 'vterm-mode 'emacs))

  (use-package evil-collection
    :after evil
    :ensure t
    :config
    (evil-collection-init))
#+end_src

* Workspace & Navigation
Finding files and executing commands should be instantaneous. We use the Ivy/Counsel ecosystem to provide fuzzy-searching across the entire editor.

** Minibuffer Superpowers
#+begin_src emacs-lisp
  (use-package diminish)

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
           ("C-x b" . counsel-ibuffer)
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . counsel-minibuffer-history))
    :config
    (counsel-mode 1))

  (global-set-key (kbd "C-s-j") 'counsel-switch-buffer)

  (use-package helpful
    :ensure t
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

* Developer Tools
These packages transform Emacs from a text editor into a full-fledged Integrated Development Environment (IDE).

** Vterm
#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000))
#+end_src

** Magit
#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status magit-get-current-branch)
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/Documents/GitHub")
      (setq projectile-project-search-path '("~/Documents/GitHub")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))
#+end_src

** Eshell
#+begin_src emacs-lisp
  (defun efs/configure-eshell ()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keys for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt)

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell)
    :config
    (eshell-git-prompt-use-theme 'robbyrussell))
    ;; Route visual programs to a real terminal automatically
    (with-eval-after-load 'esh-opt
      (setq eshell-destroy-buffer-when-process-dies t)
      (setq eshell-visual-commands '("htop" "zsh" "vim")))
#+end_src

* The Org Universe
Org mode is the ultimate system for note-taking, task management, and literate programming. This section makes it look beautiful and wires up code execution.

** Visual Formatting
#+begin_src emacs-lisp
  (defun my/org-mode-setup ()
    (org-indent-mode)
    (visual-line-mode 1))

  (use-package org
    :hook (org-mode . my/org-mode-setup)
    :config
    (setq org-ellipsis " ▾")
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-agenda-files '("~/Documents/GitHub/bmacs/orgFiles/Task.org")))

  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :weight 'regular :height (cdr face)))

  (defun my/org-visual-fill ()
    (setq visual-fill-column-width 100
          visual-fill-column-center-text t)
    (visual-line-mode 1)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . my/org-visual-fill))
#+end_src

** Org Babel (Code Execution)
#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python     . t)
       (java       . t)
       (js         . t)
       (shell      . t)))

    (setq org-confirm-babel-evaluate nil)
    (setq org-babel-python-command "python3"))

  (require 'org-tempo)
#+end_src

*** Auto-Tangle Configuration
Automatically extract the code from this file into =config.el= every time we save.

#+begin_src emacs-lisp
  (defun my/org-babel-tangle-config ()
    "Automatically tangle our config.org file when we save it."
    (when (string-equal (file-name-nondirectory (buffer-file-name))
                        "Config.org")
      ;; Tangle the file without asking for confirmation
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  ;; Add the function to the 'after-save-hook' specifically for Org mode
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'my/org-babel-tangle-config)))
#+end_src

* Development
** Languages
*** Language Servers

#+begin_src emacs-lisp
  (defun efs/lsp-mode-setup ()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode))

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
    :config
    (lsp-enable-which-key-integration t))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

  ;; 1. Load the core file explorer first
  (use-package treemacs
    :ensure t
    :bind
    ("C-c t t" . treemacs))               ;; Shortcut to toggle the sidebar

  ;; 2. Make Vim keys work inside the explorer
  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)

  ;; 3. Finally, wire the explorer up to the Language Server
  (use-package lsp-treemacs
    :after (treemacs lsp)                 ;; Only load after both treemacs AND lsp exist
    :ensure t)
#+end_src

*** TypeScript

#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))
#+end_src

** Company Mode

#+begin_src emacs-lisp
  (use-package company
    :after lsp-mode
    :hook (prog-mode . company-mode)
    :bind (:map company-active-map
           ("<tab>" . company-complete-selection))
          (:map lsp-mode-map
           ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0))

  (use-package company-box
    :hook (company-mode . company-box-mode))
#+end_src

** Dired (File Manager)
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom
    (dired-listing-switches "-agho")
    (dired-use-ls-dired nil)
    (dired-kill-when-opening-new-dired-buffer t)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file))

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

  ;; We removed the :hook from this package!
  ;; It is now loaded, but it WON'T automatically hide files.
  (use-package dired-hide-dotfiles
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
#+end_src

** Auto Package Update
Automatically checks for package updates every 7 days, prompts you before downloading, and cleans up old versions so your Emacs directory doesn't bloat.

#+begin_src emacs-lisp
    (use-package auto-package-update
      :custom
      (auto-package-update-interval 7)
      (auto-package-update-prompt-before-update t)
      (auto-package-update-hide-results t)
      (auto-package-update-delete-old-versions t)
      :config
      (auto-package-update-maybe)
      (auto-package-update-at-time "09:00"))
#+end_src
